Repository: dubstar-04/Design
Catalog: po/*.po
Languages: it, pt_br

source: CAD;DXF;drawing;design;vector;
it: CAD;DXF;disegno;progettazione;vettore;
pt_br: CAD;DXF;desenho;design;vetor;

source: 2D CAD for GNOME
it: CAD 2D per GNOME
pt_br: CAD 2D para GNOME

source: Design is a 2D computer aided design application (CAD), created to meet the needs of makers and designers, hobbyists and professionals that require a first class CAD application.
it: esigenze di maker e designer, hobbisti e professionisti che necessitano di un applicazione CAD di prima classe.
pt_br: Design é um aplicativo de design auxiliado por computador (CAD) 2D, criado para atender às necessidades de fabricantes e designers, amadores e profissionais que exigem um aplicativo CAD de primeira classe.

source: Features:
it: Caratteristiche:
pt_br: Características:

source: Supports the industry standard DXF format
it: Supporta il formato DXF standard del settore
pt_br: Suporta o formato DXF padrão da indústria

source: Uses common CAD workflows, commands and canvas management
it: Utilizza flussi di lavoro, comandi e gestione del canvas CAD comuni
pt_br: Utiliza fluxos de trabalho CAD comuns, comandos e gerenciamento de tela

source: Drawing creation and manipulation using commandline or toolbar input
it: Creazione e manipolazione di disegni utilizzando l'input della riga di comando o della barra degli strumenti
pt_br: Criação e manipulação de desenhos usando linha de comando ou entrada de barra de ferramentas

source: Layer management and manipulation
it: Gestione e manipolazione dei livelli
pt_br: Gerenciamento e manipulação de camadas

source: Entity interogation and modification
it: Interazione e modifica di entità
pt_br: Interrogatório e modificação de entidades

source: Main Window
it: Finestra principale
pt_br: Janela principal

source: Layer Manager
it: Gestore livelli
pt_br: Gerenciador de Camadas

source: Properties
it: Proprietà
pt_br: Propriedades

source: Fix tabs not being shown
it: Corrette le schede che non venivano visualizzate
pt_br: Corrigir guias que não estavam sendo exibidas

source: Show crosshair cursor on the canvas
it: Mostra il cursore a mirino sull'area di disegno
pt_br: Mostrar cursor de retículo na tela

source: Add touch controls, pan, pinch to zoom and double tap to zoom all
it: Aggiungi controlli touch, panoramica, pizzica per ingrandire e tocca due volte per ingrandire tutto
pt_br: Adicione controles de toque, panorâmica, pinça para ampliar e toque duplo para ampliar tudo

source: Hide toolbars and commandline on touch input
it: Nascondi le barre degli strumenti e la riga di comando durante l'input touch
pt_br: Ocultar barras de ferramentas e linha de comando na entrada de toque

source: Add layer manager and properties to app menu. Remove header bar buttons
it: Aggiungi gestore livelli e proprietà al menu dell'app. Rimuovere i pulsanti della barra dell'intestazione
pt_br: Adicionar gerenciador de camadas e propriedades ao menu do aplicativo. Remover botões da barra de cabeçalho

source: Fixes for text rotation
it: Correzioni per la rotazione del testo
pt_br: Correções para rotação de texto

source: Show app name capitalised in overview
it: Mostra il nome dell'app in maiuscolo nella panoramica
pt_br: Mostrar nome do aplicativo em maiúsculas na visão geral

source: Invert zoom direction
it: Inverte la direzione dello zoom
pt_br: Inverter direção do zoom

source: Load any preselected entities when opening the properties window
it: Carica eventuali entità preselezionate all'apertura della finestra delle proprietà
pt_br: Carregue quaisquer entidades pré-selecionadas ao abrir a janela de propriedades

source: Fix right mouse button behaviour
it: Correzione del comportamento del pulsante destro del mouse
pt_br: Corrigir o comportamento do botão direito do mouse

source: Fix files being read incorrectly
it: Corretto i file letti in modo errato
pt_br: Corrigir arquivos que estão sendo lidos incorretamente

source: Fix ARC selection
it: Corretta la selezione dell'ARC
pt_br: Corrigir seleção de ARC

source: Improve selection precision
it: Migliorata la precisione della selezione
pt_br: Melhore a precisão da seleção

source: Added ability to Save As
it: Aggiunta la possibilità di salvare con nome
pt_br: Adicionada a capacidade de Salvar como

source: Added keyboard shortcuts: CTRL+N (New), CTRL+S (Save), CTRL+SHIFT+S (Save As) CTRL+O (Open)
it: Come) CTRL+O (Apri)
pt_br: Atalhos de teclado adicionados: CTRL+N (Novo), CTRL+S (Salvar), CTRL+SHIFT+S (Salvar como) CTRL+O (Abrir)

source: CTRL+1 (Properties),CTRL+G (Toggle Grid), F1 (Help)
it: CTRL+1 (Proprietà),CTRL+G (Attiva/disattiva griglia), F1 (Aiuto)
pt_br: CTRL+1 (Propriedades), CTRL+G (Alternar grade), F1 (Ajuda)

source: F8 (Toggle Ortho), F9 (Toggle Polar)
it: F8 (Attiva orto), F9 (Attiva polare)
pt_br: F8 (Alternar Orto), F9 (Alternar Polar)

source: FOSDEM release!
it: Rilascio FOSDEM!
pt_br: Lançamento do FOSDEM!

source: Enable 'open with' from the file browser
it: Abilita "apri con" dal browser dei file
pt_br: Habilitar 'abrir com' no navegador de arquivos

source: Show notifications for DI and ID commands
it: Mostra notifiche per i comandi DI e ID
pt_br: Mostrar notificações para comandos DI e ID

source: Recolor the canvas for dark/light styles
it: Ricolora canvas per stili scuri/chiari
pt_br: Recolorir a tela para estilos claros/escuros

source: End current command with a right click
it: Termina il comando corrente con un clic destro
pt_br: Finalizar o comando atual com um clique direito

source: Enable changing preferences
it: Abilita la modifica delle preferenze
pt_br: Habilitar a alteração de preferências

source: New icon!
it: Nuova icona!
pt_br: Novo ícone!

source: Preview release
it: Anteprima della versione
pt_br: Versão de pré-visualização

source: Layers
it: Livelli
pt_br: Camadas

source: _Cancel
it: _Annulla
pt_br: _Cancelar

source: _Delete
it: _Elimina
pt_br: _Deletar

source: Name
it: Nome
pt_br: Nome

source: Frozen
it: Congelato
pt_br: Congelado

source: Frozen layers are not shown or available for any actions
it: I livelli congelati non vengono visualizzati né sono disponibili per alcuna azione
pt_br: Camadas congeladas não são mostradas nem estão disponíveis para nenhuma ação

source: Locked
it: Bloccato
pt_br: Trancado

source: Locked layers are visible but not able to be selected
it: I livelli bloccati sono visibili ma non possono essere selezionati
pt_br: Camadas bloqueadas são visíveis, mas não podem ser selecionadas

source: Line Type
it: Tipo di linea
pt_br: Tipo de linha

source: Line type for the selected layer. Not implimented
it: Tipo di linea per il livello selezionato. Non implementato
pt_br: Tipo de linha para a camada selecionada. Não implementado

source: Line Weight
it: Peso della linea
pt_br: Espessura da linha

source: Line weight for the selected layer. Not implimented
it: Spessore della linea per il livello selezionato. Non implementato
pt_br: Espessura da linha para a camada selecionada. Não implementado

source: Plotting
pt_br: Plotagem

source: Layers with plotting true will appear on prints
it: Verranno stampati i layer con "true" in "Plot\
pt_br: Camadas com plotagem verdadeira aparecerão nas impressões

source: End Snap
it: Unire con punti alle estremità
pt_br: Fim do snap

source: Mid Snap
it: Unisci con il punto al medio
pt_br: Meio Snap

source: Centre Snap
it: Unir con punto en el centro
pt_br: Snap central

source: Nearest Snap
it: Unisciti al punto più vicino
pt_br: Snap mais próximo

source: Ortho
it: Ortogonale
pt_br: Orto

source: Canvas
pt_br: Tela

source: Draw Grid
it: Disegna griglia
pt_br: Desenhar grade

source: Entities
it: Entità
pt_br: Entidades

source: Draw Line
it: Disegna linea
pt_br: Desenhar linha

source: Draw Polyline
it: Disegna polilinea
pt_br: Desenhar polilinha

source: Draw Circle
it: Disegna cerchio
pt_br: Desenhar Círculo

source: Draw Arc
it: disegna arco
pt_br: Desenhar Arc

source: Draw Rectangle
it: disegna rettangolo
pt_br: Desenhar retângulo

source: Tools
it: Strumenti
pt_br: Ferramentas

source: Move
it: Muovi
pt_br: Mover

source: Copy
it: Copia
pt_br: Cópia

source: Rotate
it: Ruota
pt_br: Girar

source: Trim
it: Rifinire
pt_br: Aparar

source: Extend
it: Estendi
pt_br: Estender

source: Erase
it: Cancella
pt_br: Apagar

source: Distance
it: Distanza
pt_br: Distância

source: Identify
it: Identifica
pt_br: Identificar

source: Open
it: Apri
pt_br: Abrir

source: Save
it: Salva
pt_br: Salvar

source: Save As
it: Salva come
pt_br: Salve como

source: Preferences
it: Preferenze
pt_br: Preferências

source: Keyboard Shortcuts
it: Scorciatoie da tastiera
pt_br: Atalhos de teclado

source: About Design
it: Informazioni su Design
pt_br: Sobre Design

source: Create a new design
it: Crea un nuovo disegno
pt_br: Crie um novo design

source: Open application menu
it: Apri il menu dell'applicazione
pt_br: Abrir menu do aplicativo

source: Edit
it: Modifica
pt_br: Editar

source: Delete
it: Elimina
pt_br: Excluir

source: Make Current
it: Rendi attuale
pt_br: Tornar atual

source: Snaps
it: Unione
